# ShowIconParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ShowIconParam Property
ParameterTypeId Class See Also
---
"Flag to display icon in Ribbon Combo Item"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ShowIconParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ShowIconParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ShowIconParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace